app/Controllers/Pages.php


        $data = [
            'title' => 'Cari Pengguna',
            'data' => $dt_catalog->paginate(10, 'data_catalog'),
---
SELECT *
FROM `data_catalog`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `data_catalog`


        $data = [
            'title' => 'CRUD',
            'data' => $dt_catalog->paginate(10, 'data_catalog'),
---
SELECT *
FROM `data_catalog`
 LIMIT 250, 10
SELECT COUNT(*) AS `numrows`
FROM `data_catalog`