app/Controllers/Pages.php

    public function index()
    {
        $currentPage = $this->request->getVar('page_data_catalog') ? $this->request->getVar('page_data_catalog') :
        1;

        $keyword = $this->request->getVar('keyword');

        $kategori = $this->request->getVar('keyword');
        $proyek = $this->request->getVar('proyek');
        $tahun = $this->request->getVar('tahun');
        if($keyword){

            $dt_catalog = $this->Model_DataEX->search($keyword);

        } else {
            $dt_catalog = $this->Model_DataEX;
        }
        $data = [
            'title' => 'Cari Pengguna',
            'data' => $dt_catalog->paginate(10, 'data_catalog'),
---
SELECT *
FROM `dataex`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `dataex`
SELECT *
FROM `data_catalog`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `data_catalog`

    public function editBerkas($id)
    {
        // session();

        $dt_catalog = $this->Model_DataEX;
        $data = [
            'validation' => \Config\Services::validation(),
            'berkas' => $dt_catalog->where('ID_BERKAS', $id)->first()
        ];
---
SELECT *
FROM `dataex`
WHERE `id_berkas` = '9'
 LIMIT 1

    public function crud(){
        $currentPage = $this->request->getVar('page_data_catalog') ? $this->request->getVar('page_data_catalog') :
        1;

        $keyword = $this->request->getVar('keyword');

        $kategori = $this->request->getVar('keyword');
        $proyek = $this->request->getVar('proyek');
        $tahun = $this->request->getVar('tahun');
        if($keyword){

            $dt_catalog = $this->Model_DataEX->search($keyword);

        } else {
            $dt_catalog = $this->Model_DataEX;
        }

        $data = [
            'title' => 'CRUD Admin',
            'data' => $dt_catalog->paginate(10, 'data_catalog'),
            'pager' => $this->Model_DataEX->pager,
            'currentPage' => $currentPage
        ];
---
SELECT *
FROM `data_catalog`
 LIMIT 10, 10
SELECT COUNT(*) AS `numrows`
FROM `data_catalog`