app/Models/ModelLogin.php

SELECT *
FROM `login`
WHERE `USERNAME` = 'adminkawasan'
AND `PASSWORD` = 'adminkawasan123'
---
    public function get_data($username, $password){
        $this->db->table('login');
        // $this->db->query("select * from login where USERNAME = 'adminkawasan' and where PASSWORD = 'adminkawasan123'");
        $data = $this->select()->where('USERNAME',$username)->where('PASSWORD', $password)->get()->getResultArray();